---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderGeometryId.#ctor(Autodesk.Revit.DB.BRepBuilderGeometryId)
source: html/a39b06bc-0c3c-c74f-d0b5-fff143444160.htm
---
# Autodesk.Revit.DB.BRepBuilderGeometryId.#ctor Method

Copy constructor

## Syntax (C#)
```csharp
public BRepBuilderGeometryId(
	BRepBuilderGeometryId other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.BRepBuilderGeometryId`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null